Repository: AkashKumar7902/translations-kde-applications
Catalog: ktimer/docmessages/ktimer.po
Languages: hi

source: The &ktimer; Handbook
hi: &ktimer; पुस्तिका

source: <firstname>A. L.</firstname> <othername></othername> <surname>Spehr</surname>
hi: <firstname>ए. एल.</firstname> <othername></othername> <surname>स्पेहर</surname>

source: ROLES_OF_TRANSLATORS
hi: अनुवादकों_की_भूमिकाएँ

source: Applications 18.04
hi: एप्लिकेशन्स 18.04

source: &ktimer; is an application that lets you start an application after a certain amount of time has passed.
hi: &ktimer; एक एप्लिकेशन है जो आपको एक निश्चित समय बीत जाने के बाद एप्लिकेशन शुरू करने की सुविधा देता है।

source: <keyword>KDE</keyword>
hi: <keyword>केडीई</keyword>

source: ktimer
hi: कतमीर

source: countdown
hi: उलटी गिनती

source: Introduction
hi: परिचय

source: &ktimer; allows you to enter several tasks and to set a timer for each of them. When the timer reaches zero, the task is executed. The timers for each task can be started, stopped, changed, or looped.
hi: &ktimer; आपको कई कार्य दर्ज करने और उनमें से प्रत्येक के लिए टाइमर सेट करने की अनुमति देता है। जब टाइमर शून्य पर पहुंच जाता है, तो कार्य निष्पादित हो जाता है। प्रत्येक कार्य के लिए टाइमर प्रारंभ, बंद, परिवर्तित या लूप किया जा सकता है।

source: Using &ktimer;
hi: &ktimer; का उपयोग करना

source: Here's a screenshot of &ktimer; when you start it for the first time
hi: यहां &ktimer का स्क्रीनशॉट दिया गया है; जब आप इसे पहली बार शुरू करते हैं

source: &ktimer; main window
hi: &ktimer; मुख्य विंडो

source: To start, first add a task by selecting <guibutton>New</guibutton>. Then type the command you wish to execute into the <guilabel>Command line:</guilabel> box. You can then adjust the settings, or start the timer countdown. When the time is up, the command will be run.
hi: आरंभ करने के लिए, पहले <guibutton>नया</guibutton> चुनकर एक कार्य जोड़ें। तबवह कमांड टाइप करें जिसे आप <guilabel>कमांड लाइन में निष्पादित करना चाहते हैं:</guilabel> बॉक्स। फिर आप सेटिंग्स समायोजित कर सकते हैं, या टाइमर शुरू कर सकते हैंउलटी गिनती. समय समाप्त होने पर आदेश चलाया जाएगा.

source: Here's a screenshot of &ktimer; after you have told it to run &konqueror;.
hi: यहां &ktimer का स्क्रीनशॉट दिया गया है; आपके द्वारा इसे &konqueror; चलाने के लिए कहने के बाद।

source: add a task
hi: एक कार्य जोड़ें

source: Let's use &konqueror; as an example. By default, it will start in 100 seconds once the timer countdown is started.
hi: आइए &konqueror का उपयोग करें; उदहारण के लिए। डिफ़ॉल्ट रूप से, टाइमर उलटी गिनती शुरू होने पर यह 100 सेकंड में शुरू हो जाएगी।

source: Here it is counting down: in 56 seconds &konqueror; will be run.
hi: यहाँ इसकी उल्टी गिनती चल रही है: 56 सेकंड में &konqueror; चलाया जाएगा.

source: 56 seconds to go
hi: और 56 सेकंड

source: Now let's start the task. Here it has been running for a bit and is partway through the countdown. In 56 seconds, &konqueror; will be started.
hi: अब काम शुरू करते हैं. यहां यह कुछ समय से चल रहा है और उलटी गिनती के बीच में है। 56 सेकंड में, &konqueror; शुरू किया जाएगा.

source: See that sliding bar? You can use it to quickly increase or decrease the amount of time on a task.
hi: वह स्लाइडिंग बार देखें? आप इसका उपयोग किसी कार्य पर समय की मात्रा को शीघ्रता से बढ़ाने या घटाने के लिए कर सकते हैं।

source: Let's add a second task.
hi: चलिए दूसरा कार्य जोड़ते हैं।

source: start another &konqueror;, you can never have too many!
hi: एक और शुरुआत करें &konqueror;, आपके पास कभी भी बहुत अधिक नहीं हो सकते!

source: Now two &konqueror;s are scheduled to be run. The top one will be run in 20 seconds, and the bottom one is currently stopped. You can add more commands. While you can never have too many &konqueror;s, you probably want to use other executables. Your own shell script, perhaps.
hi: अब दो &konquerors चलाने का कार्यक्रम है। शीर्ष वाला 20 सेकंड में चलेगा, और निचला वाला फिलहाल रुका हुआ है। आप और कमांड जोड़ सकते हैं. हालाँकि आपके पास कभी भी बहुत सारे &konqueror; नहीं हो सकते, आप शायद अन्य निष्पादनयोग्यों का उपयोग करना चाहेंगे। शायद आपकी अपनी शेल स्क्रिप्ट।

source: If you want to start a new task with a certain delay after the previous task in the list is finished check the option <guilabel>Consecutive task</guilabel> and adjust the time specified in the column <guilabel>Delay</guilabel>.
hi: यदि आप सूची में पिछला कार्य समाप्त होने के बाद एक निश्चित देरी के साथ एक नया कार्य शुरू करना चाहते हैं, तो <guilabel>लगातार कार्य</guilabel> विकल्प की जाँच करें और कॉलम <guilabel>विलंब</guilabel> में निर्दिष्ट समय को समायोजित करें।

source: Settings
hi: समायोजन

source: <guibutton>New</guibutton>
hi: <guibutton>नया</guibutton>

source: Adds a new task.
hi: एक नया कार्य जोड़ता है.

source: Remove
hi: निकालना

source: Removes the current task.
hi: वर्तमान कार्य को हटा देता है.

source: Help
hi: मदद

source: Opens the Handbook.
hi: इससे हैंडबुक खुल जाती है.

source: Credits and License
hi: क्रेडिट और लाइसेंस

source: CREDIT_FOR_TRANSLATORS
hi: अनुवादकों_के_लिए_श्रेय
