Repository: AkashKumar7902/translations-kde-applications
Catalog: kcharselect/docmessages/kcharselect.po
Languages: hi

source: KCharSelect
hi: के-चार-सेलेक्ट

source: <firstname>Daniel</firstname> <surname>Laidig</surname> <address><email>laidig@kde.org</email></address>
hi: <firstname>डैनियल</firstname> <surname>लेडिग</surname><address><email>laidig@kde.org</email></address>

source: ROLES_OF_TRANSLATORS
hi: अनुवादकों_की_भूमिकाएँ

source: 1.12 (Applications 16.04)
hi: 1.12 (अनुप्रयोग 16.04)

source: <keyword>KDE</keyword>
hi: <keyword>केडीई</keyword>

source: character
hi: अक्षर

source: font
hi: फ़ॉन्ट

source: &kcharselect; is a tool to select special characters from all installed fonts and copy them in different format (Plain text, Unicode or &HTML;) into the clipboard.
hi: &kcharselect; सभी स्थापित फ़ॉन्ट्स से विशेष वर्णों को चुनने और उन्हें क्लिपबोर्ड में विभिन्न प्रारूप (सादा पाठ, यूनिकोड या &HTML;) में कॉपी करने का एक उपकरण है।

source: Double clicking on a character in the preview or pressing &Enter; adds it to the bar below the font preview. This feature allows to collect a word or a group of several characters and copy them together to the clipboard.
hi: पूर्वावलोकन में किसी वर्ण पर डबल क्लिक करना या &Enter दबाना; इसे फ़ॉन्ट पूर्वावलोकन के नीचे बार में जोड़ता है। यह सुविधा एक शब्द या कई वर्णों के समूह को इकट्ठा करने और उन्हें क्लिपबोर्ड पर एक साथ कॉपी करने की अनुमति देती है।

source: Use <guimenuitem>Flip Text</guimenuitem> to reverse the order of the chosen characters.
hi: चुने गए वर्णों के क्रम को उलटने के लिए <guimenuitem>फ़्लिप टेक्स्ट</guimenuitem> का उपयोग करें।

source: By default characters are added to the right end of the group or cursor position. With <guimenuitem>Reverse Direction</guimenuitem> you can change this behavior and add characters in the left direction.
hi: डिफ़ॉल्ट रूप से वर्ण समूह के दाएँ छोर या कर्सर स्थिति में जोड़े जाते हैं। <guimenuitem>विपरीत दिशा</guimenuitem> के साथ आप इस व्यवहार को बदल सकते हैं और बाईं दिशा में अक्षर जोड़ सकते हैं।

source: You can browse characters by their category or quickly find a certain character by searching for its name. &kcharselect; displays various information about the selected character. This includes not only the Unicode character name, but also aliases, general notes and cross references to similar characters.
hi: आप पात्रों को उनकी श्रेणी के आधार पर ब्राउज़ कर सकते हैं या किसी निश्चित पात्र का नाम खोजकर उसे तुरंत ढूंढ सकते हैं। &kcharselect; चुने गए वर्ण के बारे में विभिन्न जानकारी प्रदर्शित करता है। इसमें केवल यूनिकोड वर्ण का नाम ही नहीं, बल्कि उपनाम, सामान्य नोट्स और समान वर्णों के संदर्भ के बारे में भी जानकारी शामिल होती है।

source: For technical use, different representations of the character are shown. &kcharselect; also contains Unihan data for East Asian characters to display English definitions and different pronunciations.
hi: तकनीकी उपयोग के लिए, वर्ण के विभिन्न प्रतिनिधित्व दिखाए जाते हैं। &kcharselect; में पूर्वी एशियाई वर्णों के लिए यूनिहान डेटा भी होता है जिससे अंग्रेजी परिभाषाएं और विभिन्न उच्चारण प्रदान को प्रदर्शित किया जाता है।
